# Class6: 17th January, 2021 Sunday

# NA handling methods:
* **dropna** jitne NA honge unko drop kardega, to sawaal hai ke kitne NA aane par col ya row drop karni hai ? to isko hum `thresholds` kehte hain

* **fillna**

# Filtering out missing data

In [1]:
from numpy import nan as NA
import numpy as np
import pandas as pd

In [2]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [3]:
data[4] = NA

In [4]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

# Chapter 7 

### 7.1 : Handling Missing Data
    
    
### 7.2 : Data Transformation
    
    
### 7.3 : String Manipulation

# 7.1 : Handling Missing Data
    
* Filtering Out Missing Data
> 1. isnull
> 2. notnull
> 3. dropna

In [5]:
# Filtering Out Missing Data

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, None])

In [7]:
# Null values kaha haim ?
string_data.isnull()

0    False
1    False
2     True
3     True
dtype: bool

In [8]:
# konsi values null hain ?

string_data[string_data.isnull()]

2     NaN
3    None
dtype: object

In [9]:
# isko jab maine check kia to original is unchanged.
string_data

0     aardvark
1    artichoke
2          NaN
3         None
dtype: object

In [10]:
string_data.notnull()

0     True
1     True
2    False
3    False
dtype: bool

In [11]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
dtype: object

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [13]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
test = data.dropna()

In [15]:
test

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
# original is unchanged
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
# inplace change
data.dropna(inplace=True)

In [18]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
 data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [22]:
# col wise
# to har col mai NA hai to kuch bhi nhi bachna, to sirf index hee arhe hain
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
# jab drop karna jab all nan hon
data.dropna(axis=0, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
# Filling in missing data

In [25]:
df = pd.DataFrame(np.random.randn(7, 3))

In [26]:
df.iloc[:4, 1] = NA

In [27]:
df.iloc[:2, 2] = NA

In [28]:
df

          0         1         2
0 -0.873786       NaN       NaN
1  0.981637       NaN       NaN
2 -0.207523       NaN -0.815924
3  1.609608       NaN -1.101726
4  0.860778 -0.742382 -1.183412
5 -0.278912  2.095166 -1.356496
6  0.169305  0.617738  0.176375

In [29]:
df.fillna(0)

          0         1         2
0 -0.873786  0.000000  0.000000
1  0.981637  0.000000  0.000000
2 -0.207523  0.000000 -0.815924
3  1.609608  0.000000 -1.101726
4  0.860778 -0.742382 -1.183412
5 -0.278912  2.095166 -1.356496
6  0.169305  0.617738  0.176375

In [30]:
df.fillna({1: 0.5, 2: 0.7})

          0         1         2
0 -0.873786  0.500000  0.700000
1  0.981637  0.500000  0.700000
2 -0.207523  0.500000 -0.815924
3  1.609608  0.500000 -1.101726
4  0.860778 -0.742382 -1.183412
5 -0.278912  2.095166 -1.356496
6  0.169305  0.617738  0.176375

# 7.2 : Data Transformation
    
* Removing Duplicated
> 1. duplicated
> 2. drop_duplicated

* Transforming Data using a Funcction or Mapping
> 1. map

* Replacing Values
> 1. replace

* Renaming Axis Indexes
> 1. rename

* Discretization And Binning
> 1. cut

* Detecting And Filtering Outliers

In [31]:
# Removing duplicated

In [32]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 1, 3, 3, 4, 4]})

In [33]:
data

    k1  k2
0  one   1
1  two   1
2  one   1
3  two   3
4  one   3
5  two   4
6  two   4

In [34]:
data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

In [35]:
data[data.duplicated()]

    k1  k2
2  one   1
6  two   4

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
3  two   3
4  one   3
5  two   4

In [37]:
data["v1"] = range(7)

In [38]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.duplicated(["k1"])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [40]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
6  two   4   6

In [42]:
# Transforming Data using A Function or Mapping

In [58]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 
                              'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [59]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [60]:
# konse waale food mai konse animal ka meat use kia hai

meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [61]:
# not good approach

# data['animal'] = ['pig', 'pig', 'pig', 'cow', 'cow', 'pig', 'cow', 'pig', 'salmon']

In [62]:
# data

In [63]:
# humne is dict ko is data ke saath map karana hai, 1 hota hai match karaana yaani apne apne index par bhejdena
# mapping mai ye hota hai ke jiska jo pair hai wo apna pair dhoondke apne apko uske saath map karle

In [64]:
lowercased = data['food'].str.lower()

In [65]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [66]:
data['animal1'] = lowercased.map(meat_to_animal)

In [67]:
data

          food  ounces animal1
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [68]:
# ab yehi kaam lambda function sai kia hai
# food sai uth kar value ayegi x mai, pehle wo lowercase hogi

data['animal'] = data['food'].map(lambda x: meat_to_animal[x.lower()])

In [69]:
data

          food  ounces animal1  animal
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

# Discretization and Binning

Continuous data is often `discretized` or otherwise `separated into “bins”` for analysis.
Suppose you have data about a group of people in a study, and you `want to group them` into discrete age buckets:

In [9]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Let’s divide these into bins of `18 to 25`, `26 to 35`, `36 to 60`, and finally `61 and older`. 

To do so, you have to use `cut`, a function in pandas:

In [10]:
bins = [18, 25, 35, 60, 100]

In [11]:
cats = pd.cut(ages, bins)

In [12]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The output you see describes the `bins computed by pandas.cut`.

You can treat it like an `array of strings` indicating the `bin name`; internally it contains a categories array specifying the distinct category names along with a `labeling for the ages data in the codes attribute`:

In [13]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [14]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [15]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

Note that `pd.value_counts(cats)` are the `bin counts` for the result of `pandas.cut`.

(2,9) ==> open  >> 2,9 excluded


[2,9] ==> close  >> 2,9 included

Consistent with mathematical notation for intervals, a `parenthesis means that the side is open`, while the `square bracket means it is closed (inclusive)`. You can `change which side is closed by passing right=False`:

In [16]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

## right : bool, default True

Indicates whether `bins` includes the rightmost edge or not. If ``right == True`` (the default), then the `bins` ``[1, 2, 3, 4]`` indicate (1,2], (2,3], (3,4]. This argument is ignored when `bins` is an IntervalIndex.

You can also pass your `own bin names` by passing a list or array to the labels option:

In [17]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [18]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will compute `equal-length bins` based on the `minimum and maximum values` in the data.


Consider the case of some uniformly distributed data chopped into fourths:

In [19]:
data = np.random.rand(20)

In [20]:
pd.cut(data, 4, precision=2)

[(0.72, 0.95], (0.72, 0.95], (0.72, 0.95], (0.72, 0.95], (0.49, 0.72], ..., (0.27, 0.49], (0.49, 0.72], (0.49, 0.72], (0.27, 0.49], (0.043, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.043, 0.27] < (0.27, 0.49] < (0.49, 0.72] < (0.72, 0.95]]

The `precision=2` option limits the decimal precision to `two digits`.

A closely related function, `qcut`, bins the data `based on sample quantiles`. Depending on the distribution of the data, using `cut will not usually result in each bin having the same number of data points`. Since `qcut uses sample quantiles instead, by definition you will obtain roughly equal-size bins`:

In [21]:
data = np.random.randn(1000) # Normally distributed

In [22]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [23]:
cats

[(-0.619, 0.0168], (-0.619, 0.0168], (-0.619, 0.0168], (0.644, 3.707], (0.0168, 0.644], ..., (-3.308, -0.619], (-0.619, 0.0168], (0.644, 3.707], (-0.619, 0.0168], (-3.308, -0.619]]
Length: 1000
Categories (4, interval[float64]): [(-3.308, -0.619] < (-0.619, 0.0168] < (0.0168, 0.644] < (0.644, 3.707]]

In [24]:
pd.value_counts(cats)

(0.644, 3.707]      250
(0.0168, 0.644]     250
(-0.619, 0.0168]    250
(-3.308, -0.619]    250
dtype: int64

Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive):

In [25]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.17, 0.0168], (-1.17, 0.0168], (-1.17, 0.0168], (0.0168, 1.281], (0.0168, 1.281], ..., (-1.17, 0.0168], (-1.17, 0.0168], (0.0168, 1.281], (-1.17, 0.0168], (-1.17, 0.0168]]
Length: 1000
Categories (4, interval[float64]): [(-3.308, -1.17] < (-1.17, 0.0168] < (0.0168, 1.281] < (1.281, 3.707]]

# Detecting and Filtering Outliers

Aisi values hoti hain jo hamri mean values sai bohot door hojati hain

In [26]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [27]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014516     0.015341    -0.012493    -0.026923
std       1.023736     0.986485     0.980302     0.962941
min      -2.880795    -3.592455    -3.546709    -2.987599
25%      -0.649781    -0.608759    -0.654913    -0.677324
50%       0.027724     0.000906    -0.039413    -0.052969
75%       0.681896     0.657653     0.648692     0.633039
max       3.602903     4.663155     3.127354     2.827405

Suppose you wanted to find values in one of the columns `exceeding 3` in `absolute value`:

In [28]:
col = data[2]

In [29]:
col

0      0.524489
1     -0.170653
2     -0.531985
3      0.113951
4     -2.363803
         ...
995   -0.303287
996   -0.831165
997   -0.190795
998    0.175786
999   -0.561155
Name: 2, Length: 1000, dtype: float64

In [30]:
col[np.abs(col) > 3]

144   -3.025888
488    3.006755
497   -3.546709
550   -3.419443
752    3.127354
Name: 2, dtype: float64

To `select all rows` having a `value exceeding 3 or –3`, you can `use the any method` on a boolean DataFrame:

In [31]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
144 -0.609381 -1.161548 -3.025888  1.157589
221  3.104028  0.036231 -0.519809  1.452743
371  0.355192  4.663155 -0.439318  0.226503
430  3.602903  0.152774  0.618837 -0.602447
488  1.381883  0.412618  3.006755 -0.689900
497  0.274176  1.170702 -3.546709  2.679367
531 -1.496548 -3.592455 -0.210710  0.115883
550  1.671679 -0.545235 -3.419443 -1.684912
637  0.432407  3.813520 -0.708215  0.749333
752  1.081849 -0.195515  3.127354  0.160631

Values can be set based on these criteria.

Here is code to cap values outside the interval –3 to 3:

In [32]:
np.sign(data)

       0    1    2    3
0    1.0  1.0  1.0 -1.0
1   -1.0 -1.0 -1.0 -1.0
2    1.0  1.0 -1.0  1.0
3    1.0  1.0  1.0  1.0
4    1.0  1.0 -1.0 -1.0
..   ...  ...  ...  ...
995 -1.0 -1.0 -1.0 -1.0
996  1.0 -1.0 -1.0  1.0
997 -1.0 -1.0 -1.0 -1.0
998  1.0  1.0  1.0 -1.0
999 -1.0 -1.0 -1.0  1.0

[1000 rows x 4 columns]

In [33]:
np.sign(data) * 3

       0    1    2    3
0    3.0  3.0  3.0 -3.0
1   -3.0 -3.0 -3.0 -3.0
2    3.0  3.0 -3.0  3.0
3    3.0  3.0  3.0  3.0
4    3.0  3.0 -3.0 -3.0
..   ...  ...  ...  ...
995 -3.0 -3.0 -3.0 -3.0
996  3.0 -3.0 -3.0  3.0
997 -3.0 -3.0 -3.0 -3.0
998  3.0  3.0  3.0 -3.0
999 -3.0 -3.0 -3.0  3.0

[1000 rows x 4 columns]

In [34]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [35]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013809     0.013456    -0.011635    -0.026923
std       1.021486     0.975188     0.976605     0.962941
min      -2.880795    -3.000000    -3.000000    -2.987599
25%      -0.649781    -0.608759    -0.654913    -0.677324
50%       0.027724     0.000906    -0.039413    -0.052969
75%       0.681896     0.657653     0.648692     0.633039
max       3.000000     3.000000     3.000000     2.827405

# 7.3 : String Manipulation

### String Object Methods

a comma-separated string can be broken into pieces with `split`:

In [40]:
val = 'a,b,  guido'
val

'a,b,  guido'

In [41]:
val.split(',')

['a', 'b', '  guido']

`split` is often combined with `strip` `to trim whitespace (including line breaks)`:

In [43]:
pieces = [x.strip() for x in val.split(',')]

In [44]:
pieces

['a', 'b', 'guido']

These substrings could be concatenated together with a two-colon delimiter using addition:

In [45]:
first, second, third = pieces

In [46]:
print(first)
print(second)
print(third)

a
b
guido

In [47]:
first + '::' + second + '::' + third

'a::b::guido'

But this isn’t a practical generic method. A faster and more Pythonic way is `to pass a list or tuple` to `the join method` on the string '::':

In [48]:
'::'.join(pieces)

'a::b::guido'

Other methods are concerned with locating substrings. Using Python’s `in keyword` is the best way to detect a substring, though `index` and `find` can also be used:

In [49]:
'guido' in val

True

In [50]:
val.index(',')

1

In [51]:
val.find(':')

-1

Note the difference between `find and index` is that `index raises an exception if the string isn’t found` (versus returning –1):

In [52]:
val.index(':')

ValueError: substring not found

replace will substitute occurrences of one pattern for another. It is commonly used to delete patterns, too, by passing an empty string: